[
  {
    "paraNum": 1,
    "text": "Ancient Greek philosophy was divided into three sciences: physics, ethics, and logic. This division is perfectly suitable to the nature of the thing; and the only improvement that can be made in it is to add the principle on which it is based, so that we may both satisfy ourselves of its completeness, and also be able to determine correctly the necessary subdivisions.",
    "original": "Die alte griechische Philosophie teilte sich in drei Wissenschaften ab: Die Physik, die Ethik und die Logik. Diese Einteilung ist der Natur der Sache vollkommen angemessen, und man hat an ihr nichts zu verbessern, als etwa nur das Prinzip derselben hinzu zu tun, um sich auf solche Art teils ihrer Vollständigkeit zu versichern, teils die notwendigen Unterabteilungen richtig bestimmen zu können."
  },
  {
    "paraNum": 2,
    "text": "All rational knowledge is either material or formal: the former considers some object, the latter is concerned only with the form of the understanding and of the reason itself, and with the universal laws of thought in general without distinction of its objects. Formal philosophy is called logic. Material philosophy, however, has to do with determinate objects and the laws to which they are subject, is again twofold; for these laws are either laws of nature or of freedom. The science of the former is physics, that of the latter, ethics; they are also called natural philosophy and moral philosophy respectively.",
    "original": "Alle Vernunfterkenntnis ist entweder material und betrachtet irgend ein Objekt; oder formal und beschäftigt sich bloß mit der Form des Verstandes und der Vernunft selbst und den allgemeinen Regeln des Denkens überhaupt ohne Unterschied der Objekte. Die formale Philosophie heißt Logik, die materiale aber, welche es mit bestimmten Gegenständen und den Gesetzen zu tun hat, denen sie unterworfen sind, ist wiederum zwiefach. Denn diese Gesetze sind entweder Gesetze der Natur, oder der Freiheit. Die Wissenschaft von der ersten heißt Physik, die der andern ist Ethik; jene wird auch Naturlehre, diese Sittenlehre genannt."
  },
  {
    "paraNum": 3,
    "text": "Logic cannot have any empirical part; that is, a part in which the universal and necessary laws of thought should rest on grounds taken from experience; otherwise it would not be logic, i.e., a canon for the understanding or the reason, valid for all thought, and capable of demonstration. Natural and moral philosophy, on the contrary, can each have their empirical part, since the former has to determine the laws of nature as an object of experience; the latter the laws of the human will, so far as it is affected by nature: the former, however, being laws according to which everything does happen; the latter, laws according to which everything ought to happen. Ethics, however, must also consider the conditions under which what ought to happen frequently does not.",
    "original": "Die Logik kann keinen empirischen Teil haben, d. i. einen solchen, da die allgemeinen und notwendigen Gesetze des Denkens auf Gründen beruhten, die von der Erfahrung hergenommen wären; denn sonst wäre sie nicht Logik, d. i. ein Kanon für den Verstand oder die Vernunft, der bei allem Denken gilt und demonstriert werden muss. Dagegen können sowohl die natürliche, als sittliche Weltweisheit jede ihren empirischen Teil haben, weil jene der Natur als einem Gegenstande der Erfahrung, diese aber dem Willen des Menschen, so fern er durch die Natur affiziert wird, ihre Gesetze bestimmen muss, die erstern zwar als Gesetze, nach denen alles geschieht, die zweiten als solche, nach denen alles geschehen soll, aber doch auch mit Erwägung der Bedingungen, unter denen es öfters nicht geschieht."
  }
]
